In [15]:
import pandas as pd
df = pd.read_csv("titanic.csv")
df.head(5)

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [16]:
df.drop(["PassengerId","Name","SibSp","Parch","Ticket","Cabin","Embarked"],axis = 'columns',inplace  = True)
df.head(5)

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [17]:
y = df["Survived"]
X = df.drop("Survived",axis = "columns")
#  X => input => independent variablr
# y => output or target => dependent variable
y.head(5)

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [18]:
X.head(5)

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [19]:
dummies = pd.get_dummies(X["Sex"])
# dummies1  =  pd.get_dummies(X.Sex)
dummies.head(5)
# dummies1.head(5)

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [20]:
X = pd.concat([X,dummies],axis = "columns")
X.head(5)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [21]:
X.drop(["Sex"],axis = "columns",inplace = True)
X.head(5)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [22]:
X.columns[X.isna().any()]

Index(['Age'], dtype='object')

In [23]:
X.Age.head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [25]:
X["Age"].head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [26]:
X.Age = X.Age.fillna(X.Age.mean())

In [57]:
X.Age.head(10)

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [58]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size = 0.2)

In [59]:
len(X_train),len(X_test),len(y_train),len(y_test)

(712, 179, 712, 179)

In [60]:
# now using navie bayes alogorithm
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [61]:
from sklearn import metrics
model.fit(X_train,y_train)

GaussianNB()

In [62]:
model.score(X_test,y_test)

0.7932960893854749

In [63]:
X_test[:10]

     Pclass        Age     Fare  female  male
784       3  25.000000   7.0500       0     1
82        3  29.699118   7.7875       1     0
96        1  71.000000  34.6542       0     1
573       3  29.699118   7.7500       1     0
526       2  50.000000  10.5000       1     0
421       3  21.000000   7.7333       0     1
858       3  24.000000  19.2583       1     0
869       3   4.000000  11.1333       0     1
608       2  22.000000  41.5792       1     0
157       3  30.000000   8.0500       0     1

In [64]:
y_test.head(10)

784    0
82     1
96     0
573    1
526    1
421    0
858    1
869    1
608    1
157    0
Name: Survived, dtype: int64

In [65]:
model.predict(X_test[:10])

array([0, 1, 0, 1, 1, 0, 1, 0, 1, 0], dtype=int64)

In [66]:
model.predict_proba(X_test[:10])

array([[0.98890495, 0.01109505],
       [0.07023313, 0.92976687],
       [0.82174747, 0.17825253],
       [0.07021961, 0.92978039],
       [0.03164211, 0.96835789],
       [0.98803095, 0.01196905],
       [0.06583509, 0.93416491],
       [0.97848639, 0.02151361],
       [0.02402539, 0.97597461],
       [0.98967599, 0.01032401]])